[
  {
    "id": 1,
    "name": "Python",
    "category": "Lenguaje",
    "proficiency": 95,
    "yearsOfExperience": 8,
    "description": "Recuerdo cuando me reconecté con Python después de una pausa de 4 años, y mi enfoque se disparó hacia la Arquitectura de Software con IA. Hoy, lo considero mi lenguaje principal para el desarrollo backend. He logrado grandes éxitos: desde construir una aplicación completa el sistema Masec en NEIVA, un proyecto crucial de gestión de volquetas, hasta el ambicioso proyecto de migrar mi sistema educativo propio, que pasó de ser un legacy en Laravel a una arquitectura SOA completa, con microservicios en ML, LangGraph y Whisper Openai. Mi especialización en IA/ML (TensorFlow, PyTorch, scikit-learn) ha sido fundamental, priorizando FastAPI para APIs de alto rendimiento, aunque también he desarrollado proyectos con Django y Flask, Fastapi es mi principal.",
    "icon": "https://svgl.app/library/python.svg",
    "audioUrl": "https://darwinyusef.s3.us-east-1.amazonaws.com/Headlines+%26+Chat+Easy+News+for+Everyday+Conversations.mp3",
    "is_active": true
  },
  {
    "id": 2,
    "name": "JavaScript",
    "category": "Lenguaje",
    "proficiency": 95,
    "yearsOfExperience": 12,
    "description": "JavaScript ha sido mi compañero desde mi formación técnica en sistemas en el 2005. Lo domino integralmente como un desarrollador Full-Stack, desde el poderoso Vanilla JS, y JQURY que usaba para maquetación, hasta el backend con Node.js/Express/Nestjs. Hoy ha sido la base para construir interfaces de usuario robustas en mis proyectos con frameworks modernos como React, Angular y Next.js, permitiéndome dar vida a mis ideas en el lado del server y del cliente.",
    "icon": "https://svgl.app/library/javascript.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 3,
    "name": "HTML/CSS",
    "category": "Lenguaje",
    "proficiency": 95,
    "yearsOfExperience": 17,
    "description": "Mi relación con el desarrollo web comenzó en el colegio, allá por el 2001, nose realmente cuantos proyectos he creado realmente han sido muchisimos cada año, cuando aprendí el HTML más básico. Desde entonces, he evolucionado para dominar la maquetación semántica, animaciones, svg, componentes y el responsive design con preprocesadores (SASS, LESS). Mis éxitos recientes se centran en la velocidad, utilizando Tailwind CSS para un diseño ágil y de alta calidad, complementando con Material UI y Bootstrap según la necesidad del proyecto.",
    "icon": "https://svgl.app/library/html5.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 4,
    "name": "TypeScript",
    "category": "Lenguaje",
    "proficiency": 92,
    "yearsOfExperience": 6,
    "description": "TypeScript fue clave para asegurar la robustez y el tipado estático en sistemas distribuidos de gran escala. Mis experiencias más importantes fueron usándolo en Universidad de Ibagué, Alcanos de Colombia, Tres Astronautas y en el desarrollo Full-Stack con Node.js (NestJS), React, Next.js, Astro js y Angular, donde logré crear código más limpio y mantenible.",
    "icon": "https://svgl.app/library/typescript.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 5,
    "name": "SQL",
    "category": "Lenguaje",
    "proficiency": 90,
    "yearsOfExperience": 10,
    "description": "El lenguaje SQL me ha permitido trabajar con bases de datos relacionales críticas como Oracle, MySQL, PostgreSQL, MariaDB y SQL Server. Un gran logro fue su aplicación en el sistema de nómina gigante de Alcanos de Colombia, y otros proyectos no tan grandes pero si robustos en tres astronautas, donde mi habilidad en la optimización de queries y el diseño de esquemas fue fundamental para la gestión de datos a gran escala. También lo usé en proyectos como Masec para la gestión de transportes y explotación de suelos en el sur de colombia.",
    "icon": "https://svgl.app/library/postgresql.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 6,
    "name": "Java",
    "category": "Lenguaje",
    "proficiency": 85,
    "yearsOfExperience": 3,
    "description": "Mi experiencia con Java, impulsada inicialmente en la Universidad y el SENA, me llevó a trabajar con Spring Boot en el backend empresarial. Mi mayor desafío y éxito con este lenguaje fue el apoyo gestión y mantenimiento del sistema de nómina gigante para Alcanos de Colombia, tambien he creado varios proyectos propios y un proyecto de gran envergadura como darkhusky. Hoy estoy explorando varias Arquitecturas entre estas la Hexagonal y los microservicios para aplicar buenas prácticas, tambien explorando JAVA IA para integrar machine learning en proyectos futuros.",
    "icon": "https://svgl.app/library/java.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 7,
    "name": "Bash/Shell",
    "category": "Lenguaje",
    "proficiency": 85,
    "yearsOfExperience": 8,
    "description": "Scripts y automatización son mi pan de cada día en el entorno de servidores. Lo utilizo activamente para facilitar el CI/CD y asegurar despliegues consistentes en servicios Cloud (AWS), haciendo que la administración del sistema sea fluido, he creado scripts en SH tambien en Makefile para automatizar tareas repetitivas y optimizar flujos de trabajo en mis proyectos hoy lo so activamente con Claude.",
    "icon": "https://svgl.app/library/bash_dark.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 8,
    "name": "PHP",
    "category": "Lenguaje",
    "proficiency": 80,
    "yearsOfExperience": 7,
    "description": "PHP fue la base de mi carrera; con él desarrollé desde plugins para WordPress hasta mi propio CMS que escalo a varias aplicaciones entre estas aplicación para laboratorio, aplicación de archivo para una empresa prestadora de servicios de salud y un sistema academico completo para tres instituciones Diagnosticar educativo y Inap ayudas pedagogicas, hoy he estado trabajando con laravel en la empresa consultoreshseqors: he apoyado en arquitectura, liderazgo y en su proyecto gamificado con Laravel, Mi experiencia con Laravel y Lumen me permitió construir sistemas empresariales a medida para clientes como la UNAD y Masec.",
    "icon": "https://svgl.app/library/php.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 9,
    "name": "Kotlin",
    "category": "Lenguaje",
    "proficiency": 75,
    "yearsOfExperience": 2,
    "description": "Mi experiencia inicial fue en el desarrollo de una aplicación móvil para mi especialización. Hoy, estoy retomando Kotlin con Jetpack Compose para enfocarme en la arquitectura MVVM y en el desarrollo Android nativo de mis futuros proyectos, he estado migrando algunos proyectos de frontend web a Kotlin web para aprovechar sus características modernas y mejorar la calidad del código. tambien haciendo algunas practicas de integración con Claude y Openai",
    "icon": "https://svgl.app/library/kotlin.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 10,
    "name": "Swift",
    "category": "Lenguaje",
    "proficiency": 70,
    "yearsOfExperience": 2,
    "description": "Swift y Swift UI forman parte de mi visión estratégica de 2026. Estoy construyendo una base sólida para desarrollar aplicaciones nativas de alta calidad para iOS, desde el año 2025 que serán el corazón de mi futura startup y academia. por ahora solo he trabajado en tareas relacionadas al crecimiento, pruebas A/B y optimización de aplicaciones existentes en la aplicación care.com",
    "icon": "https://svgl.app/library/swift.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 11,
    "name": "Go (Golang)",
    "category": "Lenguaje",
    "proficiency": 70,
    "yearsOfExperience": 2,
    "description": "Me especialicé en Go para enfrentar desafíos de alta concurrencia. Durante los ultimos 2 años, he utilizado frameworks como Fiber y muy poco GIN para crear herramientas de convergencia de eventos y microservicios de alto rendimiento, todo contenedorizado con Docker, he estado explorando Go para proyectos de backend de alto rendimiento y microservicios, aprovechando su eficiencia y concurrencia, en mi apliación educativa principal he adicionado algunos microservicios en Go para tareas específicas que requieren alta eficiencia, como procesamiento de datos en tiempo real, la verdad uno conoce Go y trabaja con el por primera vez y se enamora de el lenguaje.",
    "icon": "https://svgl.app/library/golang_dark.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 12,
    "name": "Tailwind CSS",
    "category": "Frameworks Frontend",
    "proficiency": 95,
    "yearsOfExperience": 5,
    "description": "Para mí, Tailwind CSS es sinónimo de velocidad y calidad. Es el framework que elijo por defecto para un diseño utility-first, permitiéndome crear rápidamente maquetaciones responsive y visualmente atractivas y ni que decir de usarlo con IA una joya para producir rapidamente proyectos este desde el año 2021 ha sido una gran herramienta para mi ahora casi todo lo hago con Tailwind apesar que olvido su sintaxis como se muy bien CSS no ha sido un problema.",
    "icon": "https://svgl.app/library/tailwindcss.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 13,
    "name": "React",
    "category": "Frameworks Frontend",
    "proficiency": 95,
    "yearsOfExperience": 7,
    "description": "React ha sido fundamental en mi carrera desde el año 2018. Lo he utilizado en la migración de mi sistema educativo, en mi proyecto académico, en proyectos de clientes en proyectos con IA hoy en día el 80% de mis proyectos se desarrollan con React y, lo que es más importante, me ha permitido crear algunos tutoriales en YouTube, y poder enseñarlo a otros convirtiendome en evangelista de este lenguaje, simplificando conceptos complejos de hooks y Context API para mi audiencia.",
    "icon": "https://svgl.app/library/react_light.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 14,
    "name": "Next.js",
    "category": "Frameworks Frontend",
    "proficiency": 90,
    "yearsOfExperience": 5,
    "description": "Si necesito crear aplicaciones React escalables con un enfoque en SEO y rendimiento, elijo Next.js. he trabajado con este en algunos proyectos desde el 2019 Me ha dado el poder del SSR y SSG para optimizar la carga de aplicaciones complejas incluyendo la creación de API routes robustas, aunque ahora luego de conocer Astro estoy migrando varios proyectos a este nuevo framework que me ha encantado. para proyectos medianos y rapidos que no tengan problema a la hora de ser estaticos.",
    "icon": "https://svgl.app/library/nextjs_icon_dark.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 15,
    "name": "Astro",
    "category": "Frameworks Frontend",
    "proficiency": 88,
    "yearsOfExperience": 4,
    "description": "Hoy en día he probado ya hace 4 años estoy muy entusiasmado con Astro. Lo estoy implementando en la construcción de mi academia, y en todos mis proyectos nuevos combinándolo con React o Svelte. Su enfoque en sitios estáticos ultra-rápidos me permite priorizar el contenido y un rendimiento inigualable. todo este portafolio fue creado full con astro sin backend, el backend directamente es TS en funciones serverless. integradas en el mismo astro, solo tiene algo que no me gusta y es su integración con Storybook, este solo lo puedo usar con react componentes",
    "icon": "https://svgl.app/library/astro-icon-dark.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 16,
    "name": "Angular",
    "category": "Frameworks Frontend",
    "proficiency": 85,
    "yearsOfExperience": 6,
    "description": "Mi dominio de Angular es de Nivel Alto. Es el framework que usé en proyectos enterprise en Alcanos de Colombia y Tres Astronautas y universidad de Ibagué. Me siento cómodo navegando en su ecosistema, siendo RxJS una herramienta esencial para el manejo de flujos de datos asíncronos, he creado aplicaciones robustas y escalables, aprovechando su arquitectura basada en componentes y servicios, lo que me ha permitido entregar soluciones empresariales de alta calidad, para proyectos nuevos uso ahora REACT y Astro, por esta razón ya no lo uso tanto pero si tengo la capacidad de retomarlo cuando sea necesario ya que lo use mucho tiempo.",
    "icon": "./img/angular.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 17,
    "name": "FastAPI",
    "category": "Frameworks Backend",
    "proficiency": 95,
    "yearsOfExperience": 6,
    "description": "FastAPI es mi elección principal en el stack Python para crear APIs con una velocidad y eficiencia impresionantes. Su validación automática me ha ahorrado incontables horas. Ha sido la pieza central en mi estrategia de backend de alto rendimiento, asegurando la escalabilidad de mis proyectos. actualmente lo he llevado a grandes proyectos y considero que es una las más altas herramietas que uso en el día a día, lo uso con pyscorpg2 y con sqlAlchemy y otras multiples herramientas en varios tipos de bases de datos. tanto relacionales como no relacionales, tambien he explorado varios tipos de arquitecturas y patrones de diseño.",
    "icon": "https://svgl.app/library/fastapi.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 18,
    "name": "Express.js",
    "category": "Frameworks Backend",
    "proficiency": 90,
    "yearsOfExperience": 7,
    "description": "Lo conocí académicamente en el SENA hace 4 años y se convirtió en mi opción minimalista de backend con Node.js. para hacer cosas rapidas que no me exijan mucho esfuerzo,  He utilizado Express para crear APIs y aplicaciones y probar arquitectura de microservicios, cuando la simplicidad y la velocidad de desarrollo son clave he llegado a un buen nivel en Express hoy en día lo uso con Typescript con Orms como Prisma js y otras multiples herramientas en varios tipos de bases de datos.",
    "icon": "https://svgl.app/library/expressjs_dark.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 19,
    "name": "Django",
    "category": "Frameworks Backend",
    "proficiency": 88,
    "yearsOfExperience": 6,
    "description": "Django me dio la capacidad de construir entornos Full-Stack completos en Python rápidamente. Lo he utilizado para el desarrollo de varios proyectos pequeños, demostrando mi habilidad para manejar su potente ORM y su admin integrado, tambien lo he usado como Django Framework y aunque no es parte de mi caja de herramientas creo que puedo desarrollar productos muy fuertes y escalables..",
    "icon": "https://svgl.app/library/django.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 20,
    "name": "Flask",
    "category": "Frameworks Backend",
    "proficiency": 80,
    "yearsOfExperience": 5,
    "description": "Cuando necesito un microframework ligero y flexible en Python, para machine-learning para hacer pruebas academicas, o integrar IOT por su facilidad y rapidez Flask es mi elección. Es ideal para crear microservicios y APIs de menor escala, manteniendo el control y la agilidad en la aplicación web. He desarrollado varios proyectos personales y académicos con Flask, aprovechando su simplicidad y extensibilidad.Flask es una gran herramienta para pruebas y PoCs rápidas.",
    "icon": "https://svgl.app/library/flask-light.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 21,
    "name": "NestJS",
    "category": "Frameworks Backend",
    "proficiency": 85,
    "yearsOfExperience": 3,
    "description": "En mi rol en Tres Astronautas, NestJS fue el framework de Node.js que utilicé para el desarrollo de tareas a nivel de backend escalable. Su estructura inspirada en Angular y el uso de TypeScript me permitieron crear soluciones empresariales robustas no lo he seguido usando ya que me e enfocado en JAVA, GO y Python pero si se requiere no tendré problema en reintegrarme nuevamente.",
    "icon": "https://svgl.app/library/nestjs.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 22,
    "name": "Spring Boot",
    "category": "Frameworks Backend",
    "proficiency": 82,
    "yearsOfExperience": 3,
    "description": "Mis 3 años de experiencia con Spring Boot fueron divididos en varias fases; primero use Spring en la universidad en la ingeniería, luego toque Java en Alcanos de colombia dentro de uno de los servicios de su aplicación empresarial. Es mi framework de elección en el ecosistema Java y por último estuve enseñando JAVA en el SENA usando Spring Boot para construir aplicaciones web robustas y escalables con diferentes aprendices, a cada uno de ellos los dirigí y desarrollaron excelentes productos, y por último en una aplicación tipo ECOMMERCE propia llamada Darkhusky para ofrecer productos para mascotas con QR, aplicando buenas prácticas de desarrollo y patrones de diseño.",
    "icon": "https://svgl.app/library/spring.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 23,
    "name": "Laravel",
    "category": "Frameworks Backend",
    "proficiency": 80,
    "yearsOfExperience": 5,
    "description": "Laravel es un marco elegante de PHP que me ha permitido crear mi propio CMS y desarrollar sistemas educativos y de marketing a la medida. El dominio de Eloquent, routing y autenticación ha sido clave para estos éxitos, hay muchas empresas que me han pedido task de desarrollo con PHP y uso laravel o lumen para ayudarles, por ejemplo estos 3 ultimos años he usado he estado trabajando con laravel en la empresa consultoreshseqors: he apoyado en arquitectura, liderazgo y en su proyecto gamificado con Laravel, tambien he trabajado con Lumen en eventos como Tecnocuero aqui en medellín y en la certificación de encadenamiento de aprendices para la media técnica.",
    "icon": "https://svgl.app/library/laravel.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 24,
    "name": "React Native",
    "category": "Mobile",
    "proficiency": 78,
    "yearsOfExperience": 2,
    "description": "Aprendí y utilicé React Native durante mi especialización tecnológica en desarrollo mobile 2022. Me dio la capacidad de desarrollar aplicaciones móviles sencillas multiplataforma para iOS y Android, reutilizando mi conocimiento en React. Aunque ahora me estoy enfocando más en el desarrollo nativo con Kotlin con Jetpack Compose y Swift, React Native sigue siendo una herramienta valiosa en mi arsenal para proyectos rápidos y multiplataforma es mi herramienta para proyectos hibridos, más economicos para mis clientes, rapidos y sencillos",
    "icon": "https://svgl.app/library/react_light.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 25,
    "name": "Jetpack Compose",
    "category": "Mobile",
    "proficiency": 75,
    "yearsOfExperience": 2,
    "description": "Lo aprendi en una especialización técnologica en el sena en al año 2020  pero hice dos semestres de esa misma especialización en el año 2015, en este tiempo estudie por primera vez Kotlin pero no lo desarrolle ya que como ya era fullstack realmente me salio trabajo solo en esa área, en este año decidí volver a retomar y hacerlo parte de mi enfoque en el desarrollo móvil nativo moderno. Lo utilizo junto con Kotlin para crear interfaces de usuario declarativas y eficientes en Android, Me gusta mucho más Jetpack compose que su ente nativo xml layout. este es obligatorio en mi camino hacia la arquitectura de software que estoy siguiendo.",
    "icon": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABwAAAAcCAMAAABF0y+mAAAAWlBMVEVHcExatmAyikU9lEpJpFdTr1tVsl1PrlRIolRQrFowiUFYtFxWs1tGnVNPr1NZtl9Vs1pRsVZduWRivWhMp1ZUr14GBAZHoVNBlEsvOzBBmksvZjE9jkY+fUJA+EjFAAAADnRSTlMAv9i+Zp1xMBW0NFHkj7ECPhsAAADQSURBVCiRzdDdEoIgEAVgTNToh11wF9Tq/V+zpRiCmu49V8inu2dUapc5fV9Mn2O/XVu7xkM5HzY61naMywdPC3U1mnivFvWEZ1mkx1HLtglj38xxF+PwHXNxsdkyIOR47wGHxuSu6Dx7qLSTC8hDMensS0GTXkaXg/hS87ZRHviONsc5WEAmja+mydZwc0VvYYXZc2o8CD5CjWsID8E0mKXoElayBbcQyHsmpTQDoLPlu6TWSmcmrQwx1pIdgMkoHemHBJEpamk7/Unzf/eRJymOFA4d4haTAAAAAElFTkSuQmCC",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 26,
    "name": "SwiftUI",
    "category": "Mobile",
    "proficiency": 70,
    "yearsOfExperience": 2,
    "description": "Junto con Swift, SwiftUI me permite construir interfaces declarativas para iOS, macOS y watchOS Lo he venido aprendiendo gracias a un gran amigo que es desarrollador mobile senior en Swift desde el año 2025 será el corazón de mi futura startup y academia. por ahora solo he trabajado en tareas relacionadas al crecimiento, pruebas A/B y tareas de optimización de aplicaciones existentes entre ellas la aplicación care.com. apartir del 2026 será parte de mi plan estratégico para desarrollar productos nativos",
    "icon": "https://svgl.app/library/swift.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 27, 
    "name": "OpenAI API",
    "category": "IA/Machine Learning",
    "proficiency": 92,
    "yearsOfExperience": 2,
    "description": "Estoy todo el tiempo usando GPT's, DALL-E, Sora y Whisper es ya parte de mi trabajo. Utilizo la API de OpenAI en proyectos personales con tocken personal con todos sus servicios activos y en la aplicación que evalua conocimientos en el SENA, y genero  aplicaciones de IA generativa de forma constante y OVAS (Objetos virtuales de aprendizaje), tambien lo uso en Langchain y LangGraph para potenciar mis agentes de IA y sistemas educativos inteligentes.", 
    "icon": "https://svgl.app/library/openai.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 28,
    "name": "LangChain",
    "category": "IA/Machine Learning",
    "proficiency": 90,
    "yearsOfExperience": 2,
    "description": "LangChain ha sido un framework fundamental que he venido aprendiendo y usando para dar el salto a la IA en mis aplicaciones. Gracias a él, he podido desarrollar la lógica de agentes aunque tengo pocos proyectos con Langchain porque me pase a (LangGraph), puedo desarrollar implementación de RAG para integrar modelos LLM. Lo utilizo con éxito para la migración y modernización de mi sistema educativo, permitiéndole 'pensar' y responder de manera inteligente, creo y uso sus agentes y agrego contexto y memoria ya sea a corto y largo plazo, tambien manejo flujos usando STATES Machines.",
    "icon": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABwAAAAcCAMAAABF0y+mAAAAM1BMVEUcPDwRNjYAMC8AKSd2goaZoaapr7T//v/g4ej49/+/xMn8+/8AFRNAVliSm6BUZWfLztSDUJcgAAAAu0lEQVR4AdWRR2JFIQhFLcgF+/5XG54lPZn/M+Qo1b0iPnzBf1LRU/oC+fjuGD/gY4NANUvRSwEUEta/DAXVKtchxSaKbH99gwWaC4Tzrw/NFkTzLvCTDxxiXxbcJlChhYOL85FlRhcTzJEnJ9SxQkuatQpVSkkE3ytBlwy8pdUPA2gCbWxupV0NGRhuVEEnGad483sUgynlScV6Xf/WKHcJhmh5SqEsJ+Hz+iz6Y31n8f0L5ON/J3tB3gAtjgsX/sngiAAAAABJRU5ErkJggg==",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 29,
    "name": "Hugging Face",
    "category": "IA/Machine Learning",
    "proficiency": 88,
    "yearsOfExperience": 2,
    "description": "He aprovechado el ecosistema de Hugging Face para acceder a modelos pre-entrenados de Transformers, usándolos en mi formación y en proyectos de Machine Learning para NLP y la IA generativa, llevo tambien explorando los diferentes modelos de Pythorch y de uso de STT y TTS tambien modelos conversacionales, aunque uso más COLAB y mi pc para pruebas voy a desarrollar más proyectos de prueba para esta plataforma.",
    "icon": "https://svgl.app/library/hugging_face.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 30,
    "name": "TensorFlow",
    "category": "IA/Machine Learning",
    "proficiency": 85,
    "yearsOfExperience": 4,
    "description": "Con mi estudio formal en IA/ML, TensorFlow ha sido mi plataforma para deep learning y redes neuronales mas usado al momento. Lo utilicé en proyectos personales de Visión por Computadora y exploración de TensorFlow Microservices, aplicándolo en la creación de modelos personalizados para tareas específicas, he trabajado con Keras y TensorFlow Extended (TFX) para construir y desplegar modelos de machine learning escalables. tambien he enseñado en cursos del SENA esta herramienta y sus conceptos basicos a jovenes aprendices.",
    "icon": "/img/tensorflow.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 31,
    "name": "PyTorch",
    "category": "IA/Machine Learning",
    "proficiency": 82,
    "yearsOfExperience": 3,
    "description": "PyTorch, junto con scikit-learn, me proporciona una base sólida para la investigación y la experimentación en deep learning. Lo he aplicado en diversos proyectos personales de ML, esta herramienta la estoy aprendiendo y probando en varios proyectos de NLP y visión por computadora, aprovechando su flexibilidad para construir y entrenar modelos personalizados, he explorado PyTorch Lightning para simplificar el proceso de entrenamiento y mejorar la reproducibilidad de mis experimentos, no la uso tanto como TensorFlow pero si tengo buen conocimiento de ella, yo me estoy migrando a esta plataforma poco a poco.",
    "icon": "/img/pytorch.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 32,
    "name": "Git",
    "category": "DevOps",
    "proficiency": 95,
    "yearsOfExperience": 12,
    "description": "Controlar las versiones es esencial. Llevo más de 12 años dominando Git, aplicando diferentes branching strategies y asegurando una colaboración fluida en equipos, siendo la base de todos mis flujos de CI/CD.",
    "icon": "https://svgl.app/library/git.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 33,
    "name": "Docker",
    "category": "DevOps",
    "proficiency": 90,
    "yearsOfExperience": 6,
    "description": "La contenerización con Docker es fundamental en mi arquitectura de microservicios. Lo utilizo activamente con Go (Golang) y Python para garantizar la portabilidad de las aplicaciones y una gran eficiencia en el ciclo de vida de CI/CD.",
    "icon": "https://svgl.app/library/docker.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 34,
    "name": "AWS",
    "category": "DevOps",
    "proficiency": 82,
    "yearsOfExperience": 5,
    "description": "Mi experiencia con AWS incluye la migración exitosa de proyectos desde servidores tradicionales a soluciones Cloud, utilizando servicios clave como EC2 y S3 para construir arquitecturas de software sólidas y escalables.",
    "icon": "https://svgl.app/library/aws_dark.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 35,
    "name": "PostgreSQL",
    "category": "Database",
    "proficiency": 90,
    "yearsOfExperience": 8,
    "description": "PostgreSQL es mi base de datos relacional avanzada de preferencia en mi stack actual (Python/Go). Siempre me enfoco en la optimización de queries y el diseño de esquemas para el mejor rendimiento posible.",
    "icon": "https://svgl.app/library/postgresql.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 36,
    "name": "MySQL",
    "category": "Database",
    "proficiency": 88,
    "yearsOfExperience": 10,
    "description": "MySQL fue mi base relacional principal, especialmente en mis proyectos con PHP/Laravel. Me permitió construir sistemas de inventario y gestión documental robustos.",
    "icon": "https://svgl.app/library/mysql-icon-dark.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 37,
    "name": "MongoDB",
    "category": "Database",
    "proficiency": 82,
    "yearsOfExperience": 5,
    "description": "Cuando mis proyectos requieren un esquema de datos dinámico, recurro a MongoDB. Su naturaleza orientada a documentos me ha permitido crear soluciones flexibles y escalables como alternativa a las bases de datos relacionales.",
    "icon": "./img/mongodb.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 38,
    "name": "Redis",
    "category": "Database",
    "proficiency": 80,
    "yearsOfExperience": 4,
    "description": "Redis es un pilar en el rendimiento de mis aplicaciones de alto tráfico. Lo utilizo activamente para caching, gestión de sesiones y pub/sub, asegurando que el backend sea lo más rápido posible.",
    "icon": "https://svgl.app/library/redis.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 39,
    "name": "LangGraph",
    "category": "IA/Machine Learning",
    "proficiency": 90,
    "yearsOfExperience": 2,
    "description": "LangGraph es la herramienta que uso para diseñar la 'mente' de mis agentes de IA. Me ha permitido crear flujos de lógica complejos y gestionar múltiples agentes conversacionales dentro de mi sistema educativo, lo que considero uno de mis logros más avanzados en el área de IA.",
    "icon": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABwAAAAcCAMAAABF0y+mAAAAM1BMVEUcPDwRNjYAMC8AKSd2goaZoaapr7T//v/g4ej49/+/xMn8+/8AFRNAVliSm6BUZWfLztSDUJcgAAAAu0lEQVR4AdWRR2JFIQhFLcgF+/5XG54lPZn/M+Qo1b0iPnzBf1LRU/oC+fjuGD/gY4NANUvRSwEUEta/DAXVKtchxSaKbH99gwWaC4Tzrw/NFkTzLvCTDxxiXxbcJlChhYOL85FlRhcTzJEnJ9SxQkuatQpVSkkE3ytBlwy8pdUPA2gCbWxupV0NGRhuVEEnGad483sUgynlScV6Xf/WKHcJhmh5SqEsJ+Hz+iz6Y31n8f0L5ON/J3tB3gAtjgsX/sngiAAAAABJRU5ErkJggg==",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 40,
    "name": "Jira",
    "category": "Herramientas",
    "proficiency": 90,
    "yearsOfExperience": 7,
    "description": "Jira es mi centro de comando para la gestión de proyectos. Lo domino para aplicar metodologías Scrum y Kanban, asegurando que el ciclo de vida del software esté perfectamente documentado y las tareas sean claras.",
    "icon": "./img/jira.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 41,
    "name": "GitHub",
    "category": "DevOps",
    "proficiency": 95,
    "yearsOfExperience": 12,
    "description": "GitHub es mi plataforma de control de versiones y colaboración diaria. Lo utilizo para todos mis proyectos, gestionando repositorios y flujos de trabajo de CI/CD de manera eficiente.",
    "icon": "https://svgl.app/library/github_dark.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 42,
    "name": "Bitbucket",
    "category": "DevOps",
    "proficiency": 80,
    "yearsOfExperience": 8,
    "description": "Bitbucket fue una plataforma esencial en los inicios de mi carrera con control de versiones. Sentó las bases de mi experiencia actual en la gestión de repositorios privados y en equipo.",
    "icon": "./img/bitbucket.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 43,
    "name": "Pytest",
    "category": "Testing",
    "proficiency": 90,
    "yearsOfExperience": 4,
    "description": "Para mí, Pytest es la garantía de calidad en mis proyectos Python (FastAPI y Django). Me permite escribir pruebas limpias y eficientes para asegurar que el backend funcione a la perfección.",
    "icon": "https://docs.pytest.org/en/stable/_static/pytest1.png",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 44,
    "name": "Jest",
    "category": "Testing",
    "proficiency": 90,
    "yearsOfExperience": 7,
    "description": "Jest ha sido mi herramienta principal para el testing unitario y de integración en el ecosistema JavaScript, utilizándolo con éxito en proyectos de React y Node.js.",
    "icon": "https://svgl.app/library/jest.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 45,
    "name": "React Testing Library",
    "category": "Testing",
    "proficiency": 75,
    "yearsOfExperience": 1,
    "description": "Mi enfoque es el comportamiento del usuario, no los detalles de la implementación. Utilizo React Testing Library para mejorar la calidad y accesibilidad, probando los componentes de React como si fuera un usuario real.",
    "icon": "https://testing-library.com/img/octopus-64x64.png",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 46,
    "name": "Playwright",
    "category": "Testing",
    "proficiency": 85,
    "yearsOfExperience": 3,
    "description": "Cuando necesito automatizar pruebas end-to-end (E2E) robustas y rápidas en navegadores, Playwright es mi solución. Me permite asegurar que toda la aplicación funcione correctamente antes de salir a producción.",
    "icon": "https://svgl.app/library/playwright.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 47,
    "name": "Storybook",
    "category": "Frameworks Frontend",
    "proficiency": 85,
    "yearsOfExperience": 4,
    "description": "Storybook es vital para el desarrollo de mi sistema de diseño. Me permite desarrollar y documentar componentes UI de forma aislada, asegurando su reutilización y consistencia en todos mis proyectos.",
    "icon": "https://svgl.app/library/storybook.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 48,
    "name": "RxJS",
    "category": "Frameworks Frontend",
    "proficiency": 80,
    "yearsOfExperience": 6,
    "description": "Mi dominio de Angular está ligado a RxJS. Es esencial para manejar flujos de datos y el estado asíncrono, permitiéndome crear aplicaciones reactivas y de alto rendimiento.",
    "icon": "https://svgl.app/library/rxjs.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 49,
    "name": "Redux",
    "category": "Frameworks Frontend",
    "proficiency": 85,
    "yearsOfExperience": 6,
    "description": "Con Redux, he logrado crear aplicaciones React escalables con un flujo de datos predecible. Lo usé durante años para gestionar el estado global en proyectos complejos.",
    "icon": "./img/redux.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 50,
    "name": "Zustand",
    "category": "Frameworks Frontend",
    "proficiency": 80,
    "yearsOfExperience": 2,
    "description": "Busco la simplicidad y el rendimiento, y Zustand es mi solución moderna y ligera para la gestión de estado en React. Lo prefiero para proyectos que buscan una alternativa más simple a Redux.",
    "icon": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABwAAAAcCAMAAABF0y+mAAAAe1BMVEVHcEwdGhYdGhcODAuabFoAAAAREg8PDQrEfGgiHhrSiXUGBQSLXEokIh+wc18dGBR8XlJbVktURTtdWlFEPjhCPDY5NS89OTMtKiVJQTpxYlczMCt1ZlokIBxPRj9hVUtZT0UTExFoXFJ9UUCSg3N/dWqeYEbOVyqlPB4jT27bAAAAFHRSTlMAqIox/gk+cvrp+lj+zPoe4Oa0gtfDlpAAAAGJSURBVCiRlZLXcuMwDEXVbBU7tpMFUdglueT/v3BJKbGc2bws+KABz6DwXhXFf8ZHiPVLWu9eEsEZ37b0oqXK3/O+PhcVdcORn+xPYKa2evcxChk3d12zwXdz6tBEUeIViBi8H7e26IehQyUCIOABwPBhg3HojgogVQIQKQXUPmFJ3T3dKA/KhNvNenRm/w17mhHACwhdb1prO7Hgbr88r/JEsIS56knfQ6bmOlwyXQmNooLV8fEIqVbFrjslmQ5rlTJA6VpP0Vqtg+uGS15nLUz1OGlrbQhutNqZj9z1LTNsGgIzWTfyOI5sJ7e+ps89Q3M6GoraJTR6rSPjBudT0xgiO8lnuFptDeIi0tKWmqOA4mjDY07LeofmnGH7XAjIxekz2MywX/TZmfUtWXRiTs44RjRf6pYqG5VYmk1o0lGI7kvaHSe6hleSDFAK3VP4AyefIDsp2RkhdJtlRetQKBtJiiDNe2Xp7+sZ0zxIB4H7ffEzKueY2TC7/lD8G3VblWXZ1r+gX+MvRD0sQ1ZcHdsAAAAASUVORK5CYII=",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 51,
    "name": "WordPress",
    "category": "CMS",
    "proficiency": 90,
    "yearsOfExperience": 7,
    "description": "WordPress fue mi entrada al mundo CMS. He creado sitios web, plugins personalizados y hasta sistemas de inventario para pequeñas empresas. Es una prueba de mi capacidad para personalizar y extender sistemas.",
    "icon": "https://svgl.app/library/wordpress.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 52,
    "name": "Joomla",
    "category": "CMS",
    "proficiency": 80,
    "yearsOfExperience": 5,
    "description": "Recuerdo usar Joomla en mis primeros años como diseñador web y en proyectos para instituciones. Sentó una base importante en mi entendimiento de los CMS.",
    "icon": "https://cdn.joomla.org/images/joomla-colours-logo.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 53,
    "name": "Notion",
    "category": "Herramientas",
    "proficiency": 85,
    "yearsOfExperience": 5,
    "description": "Notion es mi centro de organización personal y profesional. Lo utilizo para la documentación, la planificación de estrategias y la organización de proyectos, a menudo como un complemento flexible a JIRA/Confluence.",
    "icon": "https://svgl.app/library/notion.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 54,
    "name": "Obsidian",
    "category": "Herramientas",
    "proficiency": 75,
    "yearsOfExperience": 2,
    "description": "Soy un ávido gestor de conocimiento, y Obsidian me permite documentar y vincular mis notas técnicas de manera eficiente usando Markdown, creando un 'cerebro digital' de mi experiencia.",
    "icon": "https://svgl.app/library/obsidian.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 55,
    "name": "Markdown",
    "category": "Herramientas",
    "proficiency": 95,
    "yearsOfExperience": 10,
    "description": "El lenguaje Markdown es fundamental en mi día a día. Lo utilizo para toda la documentación técnica, desde archivos README en GitHub hasta la documentación estructurada en Confluence y mis notas personales.",
    "icon": "https://www.markdownguide.org/assets/images/markdown-mark-white.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 56,
    "name": "Sentry",
    "category": "DevOps",
    "proficiency": 80,
    "yearsOfExperience": 4,
    "description": "Sentry me ha ayudado a dormir tranquilo. Lo integro en mis aplicaciones para monitorear errores y rendimiento en producción, asegurando una detección y corrección de fallos eficiente en mis flujos de CI/CD.",
    "icon": "https://svgl.app/library/sentry.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 57,
    "name": "DynamoDB",
    "category": "Database",
    "proficiency": 82,
    "yearsOfExperience": 5,
    "description": "Cuando necesito soluciones NoSQL de alta disponibilidad y escalabilidad en AWS, utilizo DynamoDB. Complementa mi stack de bases de datos para arquitecturas serverless y basadas en microservicios.",
    "icon": "https://svgl.app/library/dynamodb.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 58,
    "name": "Firebase",
    "category": "Database/Cloud",
    "proficiency": 80,
    "yearsOfExperience": 4,
    "description": "Firebase me ha simplificado el desarrollo de aplicaciones web y móviles modernas, ofreciendo una base de datos NoSQL y una solución Backend as a Service (BaaS) completa.",
    "icon": "https://svgl.app/library/firebase.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 59,
    "name": "Supabase",
    "category": "Database/Cloud",
    "proficiency": 80,
    "yearsOfExperience": 2,
    "description": "Como alternativa open source a Firebase, utilizo Supabase por su base en PostgreSQL. Me permite construir proyectos Full-Stack modernos manteniendo el poder de una base de datos relacional robusta.",
    "icon": "https://svgl.app/library/supabase.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 61,
    "name": "SQL Server",
    "category": "Database",
    "proficiency": 80,
    "yearsOfExperience": 5,
    "description": "He utilizado SQL Server en entornos empresariales que demandan alta disponibilidad y escalabilidad, añadiéndolo a mi amplio dominio en bases de datos relacionales tambien en el sistema de nómina de Alcanos de Colombia fue una experiencia crucial, demostrando mi habilidad para manejar bases de datos relacionales empresariales críticas a gran escala.",
    "icon": "https://svgl.app/library/sql-server.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 62,
    "name": "Kubernetes",
    "category": "DevOps",
    "proficiency": 70,
    "yearsOfExperience": 2,
    "description": "Aunque mi conocimiento es conceptual, tengo claro que Kubernetes es el futuro de la orquestación. Es la base teórica de mi enfoque en arquitecturas de microservicios y despliegues a gran escala.",
    "icon": "https://svgl.app/library/kubernetes.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 63,
    "name": "Linux",
    "category": "DevOps",
    "proficiency": 88,
    "yearsOfExperience": 10,
    "description": "Linux es la columna vertebral de mi experiencia en administración de sistemas. Mi dominio en scripting (Bash/Shell) y despliegues CI/CD se fundamenta en mi manejo de este sistema operativo para servidores.",
    "icon": "https://svgl.app/library/linux.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 64,
    "name": "Confluence",
    "category": "Herramientas",
    "proficiency": 90,
    "yearsOfExperience": 7,
    "description": "Junto con Jira, Confluence es donde documento la 'historia' de mis proyectos. Lo uso para detallar la arquitectura, el análisis, el diseño y el ciclo de vida completo del software.",
    "icon": "https://svgl.app/library/atlassian.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 65,
    "name": "GitLab",
    "category": "DevOps",
    "proficiency": 85,
    "yearsOfExperience": 6,
    "description": "Utilizo GitLab para la gestión de repositorios privados y, más importante, para la automatización de pipelines de CI/CD, facilitando flujos de trabajo de desarrollo ágiles.",
    "icon": "https://svgl.app/library/gitlab.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 66,
    "name": "scikit-learn",
    "category": "IA/Machine Learning",
    "proficiency": 85,
    "yearsOfExperience": 4,
    "description": "Es la biblioteca fundamental que utilicé en mi especialización para el Machine Learning clásico. Me permitió construir diversos modelos de ML y realizar análisis predictivos con facilidad. estuve en proceso de exploración de los diferentes modelos por dos años cuando estuve estudiando IA/ML de forma formal y analisis de datos yo diria que es mi segunda herramienta más importante despues de Tensorflow, tambien he usado esta herramienta en proyectos personales de ML, mas que todo en clasificación y regresión, tambien he enseñado la herramienta en tecnicos y cursos del SENA En ML",
    "icon": "https://svgl.app/library/python.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 67,
    "name": "Pandas",
    "category": "Análisis de Datos",
    "proficiency": 90,
    "yearsOfExperience": 5,
    "description": "En el análisis de datos, Pandas es indispensable. Lo utilizo constantemente para manipular, limpiar y preparar datasets, que es el primer paso crucial para cualquier proyecto de Ciencia de Datos.",
    "icon": "https://svgl.app/library/pandas.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 68,
    "name": "NumPy",
    "category": "Análisis de Datos",
    "proficiency": 90,
    "yearsOfExperience": 5,
    "description": "NumPy es la base de mi trabajo en Machine Learning y la computación numérica. Me permite realizar operaciones vectoriales de alto rendimiento, esenciales para TensorFlow y PyTorch.",
    "icon": "https://svgl.app/library/numpy.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 69,
    "name": "Power BI",
    "category": "Análisis de Datos",
    "proficiency": 80,
    "yearsOfExperience": 4,
    "description": "He aprovechado Power BI para transformar datos complejos en informes interactivos. Me permite presentar visualizaciones de Business Intelligence de manera clara y concisa a stakeholders.",
    "icon": "https://svgl.app/library/powerbi.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 70,
    "name": "Figma",
    "category": "Diseño/UX",
    "proficiency": 90,
    "yearsOfExperience": 5,
    "description": "Para mí, un buen código empieza con un buen diseño. Utilizo Figma para el diseño UI/UX y el prototipado, asegurando que la experiencia de usuario de mis aplicaciones sea intuitiva y agradable.",
    "icon": "https://svgl.app/library/figma.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 71,
    "name": "Adobe Premiere",
    "category": "Multimedia",
    "proficiency": 90,
    "yearsOfExperience": 7,
    "description": "Mi habilidad no solo es técnica; también he creado más de 70 videos en YouTube. Adobe Premiere ha sido la herramienta clave para editar este contenido, desde tutoriales hasta videos publicitarios.",
    "icon": "https://svgl.app/library/adobepremiere.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 72,
    "name": "After Effects",
    "category": "Multimedia",
    "proficiency": 85,
    "yearsOfExperience": 5,
    "description": "Lo uso para darle un toque profesional a mis videos. Con After Effects creo gráficos en movimiento y animaciones que enriquecen mi contenido digital y tutoriales.",
    "icon": "https://svgl.app/library/aftereffects.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 73,
    "name": "Moodle",
    "category": "CMS",
    "proficiency": 85,
    "yearsOfExperience": 6,
    "description": "Como educador, he administrado y utilizado Moodle para plataformas de capacitación, lo que demuestra mi capacidad para gestionar sistemas de gestión de aprendizaje (LMS).",
    "icon": "https://images.icon-icons.com/2415/PNG/512/moodle_original_logo_icon_146420.png",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 74,
    "name": "PrestaShop",
    "category": "CMS",
    "proficiency": 80,
    "yearsOfExperience": 5,
    "description": "He utilizado PrestaShop para ayudar a construir tiendas en línea, dándome experiencia en la plataforma de comercio electrónico.",
    "icon": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACAAAAAgCAMAAABEpIrGAAAAYFBMVEWk2+im3eqp4vCo4e6WyNRBV1xIYGZNZ21hgoqDr7mRws0AAABymKGr5fJAVVp3oKkcJShaeH8FBwit5/U1R0smMzYuPUFaeICh1+RskJkPFBV+qLJdfYSItsGd0d4vP0OXzBplAAAAqklEQVR4AdWQRQLDMAwETUFFYcb//7I1lJX0VliTYExifyUunKTkZF55vlUQRlISQAx3SvANAJ7YA9IsSvLzWggSKGOsqkpqU3EKqFnc5EXWns1Okldw0Q9g1AgSGCdE3mqrRAqYaxgTXLSZk8C61gDDqk1fUoBfVb2qMm1GnAIgiN0rNzyuZNnzQ6B2eRpoigU52wEUCkTh0hQQu9y3gHEcacARqMXZL+oEWmIOXaOG/jcAAAAASUVORK5CYII=",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 75,
    "name": "SuperTest",
    "category": "Testing",
    "proficiency": 85,
    "yearsOfExperience": 5,
    "description": "SuperTest me permite realizar testing de integración de APIs HTTP en Node.js, complementando Jest para tener un backend Node.js completamente probado.",
    "icon": "https://avatars.githubusercontent.com/u/32481436?s=48&v=4",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 76,
    "name": "Cypress",
    "category": "Testing",
    "proficiency": 80,
    "yearsOfExperience": 4,
    "description": "Cypress es mi elección moderna para la automatización de pruebas End-to-End (E2E), asegurando que mis aplicaciones web funcionen correctamente desde la perspectiva del usuario.",
    "icon": "./img/cypress.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 77,
    "name": "Svelte",
    "category": "Frameworks Frontend",
    "proficiency": 75,
    "yearsOfExperience": 1,
    "description": "Estoy explorando activamente Svelte por su enfoque en el rendimiento. Lo estoy combinando con Astro en mis proyectos recientes para crear interfaces de usuario de muy alta velocidad.",
    "icon": "https://svgl.app/library/svelte.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 78,
    "name": "Supervised Learning",
    "category": "IA/Machine Learning",
    "proficiency": 85,
    "yearsOfExperience": 4,
    "description": "Domino los modelos de aprendizaje supervisado; es una de las bases de mi especialización. He aplicado estos algoritmos con éxito usando librerías como scikit-learn en varios proyectos de ML por ahora todo a nivel Academico y en proyectos propios. que estoy usando a nivel de aplicaciones academicas en el momento",
    "icon": "https://svgl.app/library/python.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  },
  {
    "id": 79,
    "name": "Unsupervised Learning",
    "category": "IA/Machine Learning",
    "proficiency": 80,
    "yearsOfExperience": 3,
    "description": "He trabajado con modelos de aprendizaje no supervisado para encontrar patrones ocultos y realizar segmentación en análisis de datos, lo que ha sido crucial para extraer valor de grandes conjuntos de datos. por ahora todo a nivel Academico y en proyectos propios. que estoy usando a nivel de aplicaciones academicas en el momento",
    "icon": "https://svgl.app/library/python.svg",
    "audioUrl": "/audio/quehacerencrisis.mp3",
    "is_active": true
  }
]